Model: "i2r"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
img (InputLayer)             [(None, 150, 150, 3)]     0         
_________________________________________________________________
separable_conv2d (SeparableC (None, 148, 148, 64)      283       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 74, 74, 64)        0         
_________________________________________________________________
separable_conv2d_1 (Separabl (None, 72, 72, 64)        4736      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 36, 36, 64)        0         
_________________________________________________________________
separable_conv2d_2 (Separabl (None, 34, 34, 128)       8896      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 17, 17, 128)       0         
_________________________________________________________________
separable_conv2d_3 (Separabl (None, 15, 15, 128)       17664     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
flatten (Flatten)            (None, 6272)              0         
_________________________________________________________________
dense (Dense)                (None, 64)                401472    
_________________________________________________________________
dense_1 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_2 (Dense)              (None, 32)                1056      
_________________________________________________________________
redshift (Dense)             (None, 1)                 33        
=================================================================
Total params: 436,220
Trainable params: 436,220
Non-trainable params: 0
_________________________________________________________________