Model: "b2g"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bands (InputLayer)           [(None, 5)]               0         
_________________________________________________________________
normalization (Normalization (None, 5)                 11        
_________________________________________________________________
dense (Dense)                (None, 32)                192       
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
gz2c (Dense)                 (None, 23)                759       
=================================================================
Total params: 2,018
Trainable params: 2,007
Non-trainable params: 11
_________________________________________________________________