Model: "b2sm"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
wise (InputLayer)            [(None, 4)]               0         
_________________________________________________________________
normalization (Normalization (None, 4)                 9         
_________________________________________________________________
dense (Dense)                (None, 32)                160       
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
smass (Dense)                (None, 1)                 33        
=================================================================
Total params: 1,258
Trainable params: 1,249
Non-trainable params: 9
_________________________________________________________________