Model: "ss2g"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
ssel (InputLayer)            [(None, 1423)]            0         
_________________________________________________________________
normalization (Normalization (None, 1423)              2847      
_________________________________________________________________
dense (Dense)                (None, 256)               364544    
_________________________________________________________________
dense_1 (Dense)              (None, 128)               32896     
_________________________________________________________________
dense_2 (Dense)              (None, 32)                4128      
_________________________________________________________________
gz2c (Dense)                 (None, 23)                759       
=================================================================
Total params: 405,174
Trainable params: 402,327
Non-trainable params: 2,847
_________________________________________________________________