Model: "s2sm"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
spectra (InputLayer)         [(None, 3522)]            0         
_________________________________________________________________
normalization (Normalization (None, 3522)              7045      
_________________________________________________________________
dense (Dense)                (None, 256)               901888    
_________________________________________________________________
dense_1 (Dense)              (None, 128)               32896     
_________________________________________________________________
dense_2 (Dense)              (None, 32)                4128      
_________________________________________________________________
smass (Dense)                (None, 1)                 33        
=================================================================
Total params: 945,990
Trainable params: 938,945
Non-trainable params: 7,045
_________________________________________________________________