Model: "f2s"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
fits (InputLayer)            [(None, 61, 61, 5)]       0         
_________________________________________________________________
separable_conv2d (SeparableC (None, 59, 59, 64)        429       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 29, 29, 64)        0         
_________________________________________________________________
separable_conv2d_1 (Separabl (None, 27, 27, 64)        4736      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 13, 13, 64)        0         
_________________________________________________________________
separable_conv2d_2 (Separabl (None, 11, 11, 128)       8896      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 5, 5, 128)         0         
_________________________________________________________________
separable_conv2d_3 (Separabl (None, 3, 3, 128)         17664     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 1, 1, 128)         0         
_________________________________________________________________
flatten (Flatten)            (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 64)                8256      
_________________________________________________________________
dense_1 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_2 (Dense)              (None, 32)                1056      
_________________________________________________________________
subclass (Dense)             (None, 4)                 132       
=================================================================
Total params: 43,249
Trainable params: 43,249
Non-trainable params: 0
_________________________________________________________________