Model: "w2s"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
wise (InputLayer)            [(None, 4)]               0         
_________________________________________________________________
normalization (Normalization (None, 4)                 9         
_________________________________________________________________
dense (Dense)                (None, 32)                160       
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
subclass (Dense)             (None, 4)                 132       
=================================================================
Total params: 1,357
Trainable params: 1,348
Non-trainable params: 9
_________________________________________________________________